{
    "src": "https://github.cfpb.gov/HMDA-Operations/Repo-formerly-known-as-Prince/edit/master/Appendix%20A%202015%20v1.md",
    "year": "2015",
    "title": "APPENDIX A TO PART 1003 - FORM AND INSTRUCTIONS FOR COMPLETION OF HMDA LOAN APPLICATION REGISTER",
    "sections": [
        {
            "title": "PAPERWORK REDUCTION ACT NOTICE",
            "description": "This report is required by law (12 U.S.C. 2801-2810 and 12 CFR 1003). An agency may not conduct or sponsor, and an organization is not required to respond to, a collection of information unless it displays a valid Office of Management and Budget (OMB) Control Number. See 12 CFR 1003.1(a) for the valid OMB Control Numbers applicable to this information collection. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing the burden, to the respective agencies and to OMB, Office of Information and Regulatory Affairs, Paperwork Reduction Project, Washington, DC 20503. Be sure to reference the applicable agency and the OMB Control Number, as found in 12 CFR 1003.1(a), when submitting comments to OMB."
        },
        {
            "id": "I",
            "title": "INSTRUCTIONS FOR COMPLETION OF LOAN APPLICATION REGISTER",
            "subsections": [
                {
                    "id": "1",
                    "label": "Instructions and designations",
                    "description": "This part to this appendix contains instructions for the completion of the loan application register. Each instruction in this appendix is identified by a number and the regulatory section and paragraph which provides the reporting requirement. The instructions are designated according to the particular regulatory provision addressed. For example, the first instruction in this appendix for reporting the action taken under § 1003.4(a)(8) may be cited as instruction 4(a)(8)-1. This paragraph may be cited as instruction I-1.",
                    "items": [
                        {
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(1)",
                                "subclause": "(i)"
                            },
                            "label": "ULI.",
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the universal loan identifier (ULI) assigned to the covered loan or application."
                                }
                            ]
                        },
                        {
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(1)",
                                "subclause": "(ii)"
                            },
                            "label": "Date Application Received.",
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the date the application was received or the date shown on the application form by year, month, and day, using numerals in the form YYYYMMDD. \n Enter \"NA\" for covered loans purchased by your institution."
                                }
                            ]
                        },
                        {
                            "label": "Loan or Application Type.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(2)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate the type of covered loan or application by entering the applicable Code from the following:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Conventional"
                                        },
                                        {
                                            "id": "2",
                                            "description": "FHA"
                                        },
                                        {
                                            "id": "3",
                                            "description": "VA"
                                        },
                                        {
                                            "id": "4",
                                            "description": "USDA Rural Housing Service or the Farm Service Agency"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 2 for the Federal Housing Administration."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 3 for the Veterans Administration."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 4 for the Rural Housing Service or the Farm Service Agency."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Use Code 1 if the covered loan or application is not insured or guaranteed by the Federal Housing Administration, the Veterans Administration, or the USDA Rural Housing Service or the Farm Service Agency."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Purpose of Loan or Application.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(3)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate the purpose of the loan or application by entering the applicable Code from the following:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Home purchase"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Home improvement"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Cash-Out Refinancing"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Refinancing"
                                        },
                                        {
                                            "id": "5",
                                            "description": "Other"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "For refinancings, enter Code 5 if, under the terms of the agreement, you were unconditionally obligated to refinance the obligation, or you were obligated to refinance the obligation subject to conditions within the borrower’s control."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Preapproval.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(4)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate whether the application or covered loan involved a request for preapproval for a home purchase loan by entering the applicable Code from the following:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Preapproval requested"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Preapproval not requested"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Not applicable"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Enter Code 1 if your institution has a preapproval program as defined in § 1003.2(b)(2) and the applicant requests a preapproval for a home purchase loan. Do not use Code 1 if a request for preapproval is withdrawn or for requests for preapproval that are closed for incompleteness; such preapproval requests are not reported under HMDA as implemented by Regulation C."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Enter Code 2 if your institution has a preapproval program as defined in § 1003.2(b)(2) but the applicant does not request a preapproval."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Enter Code 3 if your institution does not have a preapproval program as defined in § 1003.2(b)(2)."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Enter Code 3 for applications for, or originations of, home improvement loans and refinancings, open-end lines of credit, reverse mortgages, loans secured by multifamily dwellings, and for purchased covered loans."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Construction Method.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(5)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate the construction method for the dwelling related to the covered loan or application by entering the applicable Code from the following:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Site-Built"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Manufactured Home"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Enter Code 1 if most of the dwelling’s elements were created at the dwelling’s permanent site (including the use of prefabricated components), or if the dwelling is a modular or other factory-built home (including a modular home with a permanent metal chassis) that does not meet the definition of a manufactured home under § 1003.2(l)."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Enter Code 2 if the dwelling meets the definition of a manufactured home under § 1003.2(l)."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(6)"
                            },
                            "label": "Occupancy Type.",
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate the occupancy status of the property to which the covered loan or application relates by entering the applicable Code from the following:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Principal residence"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Second residence"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Investment property"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "For purchased loans, use Code 1 unless the application or documents for the covered loan indicate that the property will not be occupied as a principal residence."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 2 for second homes or vacation homes."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 3 for investment properties."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Loan Amount.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(7)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the amount of the covered loan or the amount applied for, as applicable, in dollars."
                                }
                            ]
                        },
                        {
                            "label": "Action Taken.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(8)",
                                "subclause": "(i)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Type of Action.",
                                    "description": "Indicate the type of action taken on the application or covered loan by using one of the following Codes.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Loan originated"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Application approved but not accepted"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Application denied"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Application withdrawn"
                                        },
                                        {
                                            "id": "5",
                                            "description": "File closed for incompleteness"
                                        },
                                        {
                                            "id": "6",
                                            "description": "Loan purchased by your institution"
                                        },
                                        {
                                            "id": "7",
                                            "description": "Preapproval request denied"
                                        },
                                        {
                                            "id": "8",
                                            "description": "Preapproval request approved but not accepted"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 1 for a covered loan that is originated, including one resulting from a request for preapproval."
                                        },
                                        {
                                            "id": "b",
                                            "description": "For a counteroffer (your offer to the applicant to make the covered loan on different terms or in a different amount from the terms or amount applied for), use Code 1 if the applicant accepts. Use Code 3 if the applicant turns down the counteroffer or does not respond."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 2 when the application is approved but the applicant (or the party that initially received the application) fails to respond to your notification of approval or your commitment letter within the specific time. Do not use this Code for a preapproval request."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Use Code 4 only when the application is expressly withdrawn by the applicant before satisfying all underwriting or creditworthiness conditions and before the institution denies the application or closes the file for incompleteness. Do not use Code 4 if a request for preapproval is withdrawn; preapproval requests that are withdrawn are not reported under HMDA."
                                        },
                                        {
                                            "id": "e",
                                            "description": "Use Code 5 if you sent a written notice of incompleteness under § 1002.9(c)(2) of Regulation B (Equal Credit Opportunity Act) and the applicant did not respond to your request for additional information within the period of time specified in your notice. Do not use this Code for requests for preapproval that are incomplete; these preapproval requests are not reported under HMDA."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Action Taken Date.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(8)",
                                "subclause": "(ii)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Date of Action.",
                                    "description": "Enter the date of action taken by year, month, and day, using numerals in the form YYYYMMDD.",
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "For covered loans originated, enter the settlement or closing date."
                                        },
                                        {
                                            "id": "b",
                                            "description": "For covered loans purchased, enter the date of purchase by your institution."
                                        },
                                        {
                                            "id": "c",
                                            "description": "For applications and preapprovals denied, applications and preapprovals approved but not accepted by the applicant, and files closed for incompleteness, enter the date that the action was taken by your institution or the date the notice was sent to the applicant."
                                        },
                                        {
                                            "id": "d",
                                            "description": "For applications withdrawn, enter the date you received the applicant’s express withdrawal, whether received in writing or orally, or enter the date shown on the notification from the applicant, in the case of a written withdrawal."
                                        },
                                        {
                                            "id": "e",
                                            "description": "For preapprovals that lead to a loan origination by the financial institution, enter the date of the origination."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Property Address and Location of Subject Property.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(9)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Property Address.",
                                    "description": "Enter a property address provided in the format as described in Section 2 Postal Addressing Standards, of Mailing Standards of the United States Postal Service Publication 28 - Postal Addressing Standards (http://pe.usps.gov/text/pub28/welcome.htm). CASS Certified software will help to meet this format.  The general format requirements for a complete address are described in Publication 28 Sub-Section 21, and consist of both the Delivery Address Line and the Last Line.  Where appropriate include the Secondary Address Unit Designators such as apartment or suite.\nFor example:\n1500 E MAIN \nAVE STE 201\nSPRINGFIELD VA 22162-1010",
                                    "subsections": [
                                        {
                                            "id": "a",
                                            "description": "a.  Details regarding formatting of the address are found in Publication 28 Sub-Section 23 Delivery Address Line.  The Delivery Address will be reported as one (1) data element.  Address components can be made up of all of the following individual items:",
                                            "notes": [
                                                {
                                                    "id": "i",
                                                    "description": "Primary Address Number"
                                                },
                                                {
                                                    "id": "ii",
                                                    "description": "Predirectional"
                                                },
                                                {
                                                    "id": "iii",
                                                    "description": "Street Name"
                                                },
                                                {
                                                    "id":"iv",
                                                    "description":"Suffix"
                                                },
                                                {
                                                    "id":"v",
                                                    "description":"Postdirectional"
                                                },
                                                {
                                                    "id":"vi",
                                                    "description":"Secondary Address Identifier"
                                                },
                                                {
                                                    "id":"vii",
                                                    "description":"Secondary Address"
                                                }
                                            ]
                                        },
                                        {
                                            "id": "b",
                                            "description": "Details regarding formatting of the City, State and ZIP are found in Publication 28 Sub-Section 22 Last Line.  The Last Line will be reported as three (3) separate elements."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Non-Standard U.S. Addressing.  Formatting for non-general U.S. style addressing including rural route, Highway Contract Route, and Puerto Rico addresses are found in Sub-Section 24, 25 and 29 respectively."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Addresses formats that will not be accepted:",
                                            "notes": [
                                                {
                                                    "id": "i",
                                                    "description": "General Delivery addresses, described in Sub-section 26. "
                                                },
                                                {
                                                    "id":"ii",
                                                    "description":"United States Postal Service addresses, described in Sub-section 27. "
                                                },
                                                {
                                                    "id":"iii",
                                                    "description":"Post Office Box addresses described in Sub-section 28."
                                                }
                                            ]
                                        },
                                        {
                                            "id": "e",
                                            "description": "For originations and purchases, the address must correspond to the property identified on the legal obligation related to the covered loan.  For applications that did not result in an origination, the address must correspond to the property identified by the applicant."
                                        },
                                        {
                                            "id": "f",
                                            "description": "Enter “NA” only if the street address is not known, for example, if the property does not have a property address at closing or if the applicant did not provide the property address of the property to the financial institution before the application was denied, withdrawn, or closed for incompleteness."
                                        },
                                        {
                                            "id": "g",
                                            "description": "Enter “NA” only if the city location is not known, for example, if the property does not have a property address at closing or if the applicant did not provide the property address of the property to the financial institution before the application was denied, withdrawn, or closed for incompleteness."
                                        },
                                        {
                                            "id":"h",
                                            "description":"Enter “NA” only if the zip code is not known, for example, if the property does not have a property address at closing or if the applicant did not provide the property address of the property to the financial institution before the application was denied, withdrawn, or closed for incompleteness."
                                        }
                                    ]
                                },
                                {
                                    "id":"2",
                                    "label":"County.",
                                    "description":"Enter the Federal Information Processing Standards (FIPS) three-digit numerical code for the county. These codes are available from the appropriate Federal Agency to which you report data."
                                },
                                {
                                    "id": "3",
                                    "label": "Census Tract",
                                    "description": "Enter the 11 digit census tract number.  Census tract numbers are defined by the U.S. Census Bureau.  Use the boundaries and codes that were in effect on January 1 of the calendar year for which you are reporting.",
                                    "notes":[
                                        {
                                            "id":"i",
                                            "description":"You may enter “NA” if the property is located in a county with a population of 30,000 or less according to the most recent decennial census conducted by the U.S. Census Bureau."
                                        }
                                    ]
                                },
                                {
                                    "id":"4",
                                    "label":"Certain Location Information Not Required.",
                                    "description":"If your institution is not required to report data for CRA purposes under § 1003.4(e), you may elect to enter “NA” for census tract for entries related to properties that are not located in the MSAs or MDs in which you have a home or branch office.  If your institution is a nondepository financial institution, you may also enter “NA” for a particular entry if your institution has not received applications for, originated, or purchased five or more covered loans related to property located in the MSA or MD in which the property securing the loan reported in the entry is located."
                                }
                            ]
                        },
                        {
                            "label": "Applicant or Borrower Information.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(10)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Appendix B to this part contains instructions for the collection of data on ethnicity, race, and sex, and also contains a sample form for data collection."
                                },
                                {
                                    "id": "2",
                                    "description": "Applicability. Report this information for covered loans that you originate as well as for applications that do not result in an origination."
                                }
                            ],
                            "notes": [
                                {
                                    "id": "a",
                                    "description": "You need not collect or report this information for covered loans that you purchase. If you choose not to report this information for covered loans that you purchase, use the Codes for \"not applicable.\""
                                },
                                {
                                    "id": "b",
                                    "description": "If the borrower or applicant is not a natural person (a corporation, partnership, or trust, for example), use the Codes for \"not applicable.\""
                                }
                            ]
                        },
                        {
                            "label": "Ethnicity, Race, Sex, and Age.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(10)",
                                "subclause": [
                                    {
                                        "id": "(i)"
                                    },
                                    {
                                        "id": "(ii)"
                                    }
                                ]
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Ethnicity of Borrower or Applicant.",
                                    "description": "Use the following Codes to indicate the ethnicity of the applicant or borrower under column “A” and of any co-applicant or co-borrower under column “CA.” If there is more than one co-applicant or co-borrower, provide the required information only for the first co-applicant or co-borrower listed on the application form.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Hispanic or Latino"
                                        },
                                        {
                                            "id": "11",
                                            "description": "Mexican"
                                        },
                                        {
                                            "id": "12",
                                            "description": "Puerto Rican"
                                        },
                                        {
                                            "id": "13",
                                            "description": "Cuban"
                                        },
                                        {
                                            "id": "14",
                                            "description": "Other Hispanic or Latino"
                                        },
                                        {
                                            "id":"141",
                                            "description":"Conditional Free Form Text Field for Code 14: Other Hispanic or Latino"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Not Hispanic or Latino"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Information not provided by applicant in mail, internet, or telephone application"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Not applicable"
                                        },
                                        {
                                            "id": "5",
                                            "description": "No co-applicant"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "If an applicant selects more than one ethnic designation, enter all Codes corresponding to the applicant’s selections."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 3 if the applicant or co-applicant does not provide the information in an application taken by mail, internet, or telephone."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 4 for “not applicable” only when the applicant or co-applicant is not a natural person or, for a covered loan that has been purchased by your institution, if you choose not to report the applicant or co-applicant information."
                                        },
                                        {
                                            "id": "d",
                                            "description": "If there are no co-applicants or co-borrowers, use Code 5 for “no co-applicant” in the co-applicant column."
                                        },
                                        {
                                            "id":"e",
                                            "description":"If Code 14 is selected, enter the origin, for example, Argentinean, Colombian, Dominican, Nicaraguan, Salvadoran, Spaniard, and so on."
                                        }
                                    ]
                                },
                                {
                                    "id": "2",
                                    "label": "Race of Borrower or Applicant.",
                                    "description": "Use the following Codes to indicate the race of the applicant or borrower under column \"A\" and of any co-applicant or co-borrower under column \"CA.\" If there is more than one co-applicant or co-borrower, provide the required information only for the first co-applicant or co-borrower listed on the application form.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "American Indian or Alaska Native"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Asian"
                                        },
                                        {
                                            "id": "21",
                                            "description": "Asian Indian"
                                        },
                                        {
                                            "id": "22",
                                            "description": "Chinese"
                                        },
                                        {
                                            "id": "23",
                                            "description": "Filipino"
                                        },
                                        {
                                            "id": "24",
                                            "description": "Japanese"
                                        },
                                        {
                                            "id": "25",
                                            "description": "Korean"
                                        },
                                        {
                                            "id": "26",
                                            "description": "Vietnamese"
                                        },
                                        {
                                            "id": "27",
                                            "description": "Other Asian"
                                        },
                                        {
                                            "id":"271",
                                            "description":"Conditional Free Form Text Field for Code 27: Other Asian"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Black or African American"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Native Hawaiian or Other Pacific Islander"
                                        },
                                        {
                                            "id": "41",
                                            "description": "Native Hawaiian"
                                        },
                                        {
                                            "id": "42",
                                            "description": "Guamanian or Chamorro"
                                        },
                                        {
                                            "id": "43",
                                            "description": "Samoan"
                                        },
                                        {
                                            "id": "44",
                                            "description": "Other Pacific Islander"
                                        },
                                        {
                                            "id":"441",
                                            "description":"Conditional Free Form Text Field for Code 41: Other Pacific Islander"
                                        },
                                        {
                                            "id": "5",
                                            "description": "White"
                                        },
                                        {
                                            "id": "6",
                                            "description": "Information not provided by applicant in mail, internet, or telephone application"
                                        },
                                        {
                                            "id": "7",
                                            "description": "Not applicable"
                                        },
                                        {
                                            "id": "8",
                                            "description": "No co-applicant"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "If an applicant selects more than one racial designation, enter all Codes corresponding to the applicant’s selections."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 6 if the applicant or co-applicant does not provide the information in an application taken by mail, internet, or telephone."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 7 for “not applicable” only when the applicant or co-applicant is not a natural person or, for a covered loan that has been purchased by your institution, if you choose not to report the applicant or co-applicant information."
                                        },
                                        {
                                            "id": "d",
                                            "description": "If there are no co-applicants or co-borrowers, use Code 8 for “no co-applicant” in the co-applicant column."
                                        },
                                        {
                                            "id":"e",
                                            "description":"If Code 27 is selected, enter the race, for example, Hmong, Laotian, Thai, Pakistani, Cambodian, and so on."
                                        },
                                        {
                                            "id":"f",
                                            "description":"If Code 44 is selected, enter the race, for example, Fijian, Tongan, and so on."
                                        }
                                    ]
                                },
                                {
                                    "id": "3",
                                    "label": "Sex of Borrower or Applicant.",
                                    "description": "Use the following Codes to indicate the sex of the applicant or borrower under column \"A\" and of any co-applicant or co-borrower under column \"CA.\"",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Male"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Female"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Information not provided by applicant in mail, internet, or telephone application"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Not applicable"
                                        },
                                        {
                                            "id": "5",
                                            "description": "No co-applicant"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 3 if the applicant or co-applicant does not provide the information in an application taken by mail, internet, or telephone."
                                        },
                                        {
                                            "id": "b",
                                            "description": " Use Code 4 for “not applicable” only when the applicant or co-applicant is not a natural person or, for a covered loan that has been purchased by your institution, if you choose not to report the applicant or co-applicant information."
                                        },
                                        {
                                            "id": "c",
                                            "description": "If there are no co-applicants or co-borrowers, use Code 5 for “no co-applicant” in the co-applicant column."
                                        }
                                    ]
                                },
                                {
                                    "id": "4",
                                    "label": "Ethnicity, Race, and Sex of Borrower or Applicant Collected on the Basis of Visual Observation or Surname.",
                                    "description": "Use the following Codes to indicate under column \"A\" or applicant or borrower and under column \"CA\" for any co-applicant or co-borrower whether the ethnicity, race, and sex of the applicant or borrower and of any co-applicant or co-borrower was collected on the basis of visual observation or surname.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Ethnicity, race, and sex collected on the basis of visual observation or surname"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Ethnicity and race collected on the basis of visual observation or surname"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Ethnicity and sex collected on the basis of visual observation or surname"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Race and sex collected on the basis of visual observation or surname"
                                        },
                                        {
                                            "id": "5",
                                            "description": "Ethnicity collected on the basis of visual observation or surname"
                                        },
                                        {
                                            "id": "6",
                                            "description": "Race collected on the basis of visual observation or surname"
                                        },
                                        {
                                            "id": "7",
                                            "description": "sex collected on the basis of visual observation or surname"
                                        },
                                        {
                                            "id": "8",
                                            "description": "Ethnicity, race, and sex not collected on the basis of visual observation or surname"
                                        }
                                    ]
                                },
                                {
                                    "id": "5",
                                    "label": "Age of Borrower or Applicant.",
                                    "description": "Enter the age of the applicant or borrower, as of the date of application, derived from the date of birth as shown on the application form, in number of years under column \"A\" and of any co-applicant or co-borrower under column \"CA.\" Or, use the following Codes as applicable.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Not applicable"
                                        },
                                        {
                                            "id": "2",
                                            "description": "No co-applicant"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 1 for “not applicable” only when the applicant or co-applicant is not a natural person or, for a covered loan that has been purchased by your institution, if you choose not to report the applicant or co-applicant information."
                                        },
                                        {
                                            "id": "b",
                                            "description": "If there are no co-applicants or co-borrowers, use Code 2 for “no co-applicant” in the co-applicant column."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Income.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(10)",
                                "subclause": "(iii)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Income. Enter the gross annual income that your institution relied on in making the credit decision or, if the application was denied or withdrawn or the file was closed for incompleteness before a credit decision that would have considered income was made, the gross annual income collected as part of the application process.",
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "For a covered loan or application related to a multifamily dwelling, enter \"NA.\""
                                        },
                                        {
                                            "id": "b",
                                            "description": "If no income information is collected as part of the application process or the covered loan applied for would not have or did not consider income, enter \"NA.\""
                                        },
                                        {
                                            "id": "c",
                                            "description": "Enter “NA” if the applicant or co-applicant is not a natural person or the covered loan has been purchased by your institution and you choose not to report the applicant or co-applicant information."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Type of Purchaser.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(11)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the applicable Code to indicate whether a covered loan that your institution originated or purchased was then sold to a secondary market entity within the same calendar year:",
                                    "codes": [
                                        {
                                            "id": "0",
                                            "description": "Covered loan was not originated or was originated or purchased but was not sold to a secondary market entity in the same calendar year covered by register."
                                        },
                                        {
                                            "id": "1",
                                            "description": "Fannie Mae"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Ginnie Mae"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Freddie Mac"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Farmer Mac"
                                        },
                                        {
                                            "id": "5",
                                            "description": "Private securitizer"
                                        },
                                        {
                                            "id": "61",
                                            "description": "Commercial bank"
                                        },
                                        {
                                            "id":"62",
                                            "description":"Savings bank"
                                        },
                                        {
                                            "id":"63",
                                            "description":"Savings association"
                                        },
                                        {
                                            "id": "71",
                                            "description": "Life insurance company"
                                        },
                                        {
                                            "id":"72",
                                            "description":"Credit union"
                                        },
                                        {
                                            "id":"73",
                                            "description":"Mortgage bank"
                                        },
                                        {
                                            "id":"74",
                                            "description":"Finance company"
                                        },
                                        {
                                            "id": "8",
                                            "description": "Affiliate institution"
                                        },
                                        {
                                            "id": "9",
                                            "description": "Other type of purchaser"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 0 for applications that were denied, withdrawn, closed for incompleteness or approved but not accepted by the applicant; and for preapproval requests that were denied or approved but not accepted by the applicant."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 0 if you originated or purchased a covered loan and did not sell it during that same calendar year. For purposes of recording the type of purchaser within 30 calendar days after the end of the calendar quarter pursuant to § 1003.4(f), use Code 0 if you originated or purchased a covered loan and did not sell it during the calendar quarter for which you are recording the data. If you sell the covered loan in a subsequent quarter of the same calendar year, use the appropriate code for the type of purchaser on your loan application register for the quarter in which the covered loan was sold. If you sell the covered loan in a succeeding year, you should not report the sale."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 2 if you conditionally assign a covered loan to Ginnie Mae in connection with a mortgage-backed security transaction."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Use Code 5 for private securitizations by purchasers other than by one of the government-sponsored enterprises identified in Codes 1 through 4. If you know or reasonably believe that the covered loan you are selling will be securitized by the institution purchasing the covered loan, then use Code 5 regardless of the type or affiliation of the purchasing institution."
                                        },
                                        {
                                            "id": "e",
                                            "description": "Use Code 8 for covered loans sold to an institution affiliated with you, such as your subsidiary or a subsidiary of your parent corporation. For purposes of § 1003.4(a)(11), the term “affiliate” means any company that controls, is controlled by, or is under common control with, another company, as set forth in the Bank Holding Company Act of 1956 (12 U.S.C. 1841 et seq.)."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Rate Spread.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(12)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "If the APR exceeds the APOR, enter a positive value. For example, enter 3.295. If the APOR exceeds the APR, enter a negative value. For example, enter -3.295."
                                },
                                {
                                    "id": "2",
                                    "description": "Enter “NA” in the case of a covered loan not subject to Regulation Z, 12 CFR part 1026, a reverse mortgage, an assumption, a purchased covered loan, or an application that does not result in a loan origination or the opening of a line of credit, except for an application that was approved but not accepted by the applicant."
                                }
                            ]
                        },
                        {
                            "label": "HOEPA Status.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(13)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate whether the covered loan that you originated or purchased is a high-cost mortgage under the Home Ownership and Equity Protection Act of 1994 (HOEPA), as implemented in Regulation Z § 1026.32 using the following Codes as applicable:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Not applicable"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Enter Code 1 if the covered loan you originated or purchased is a high-cost mortgage under HOEPA because the annual percentage rate and/or points and fees for the transaction exceed the high-cost mortgage thresholds."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Enter Code 2 if the covered loan you originated or purchased is not a high-cost mortgage under HOEPA."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Enter Code 3 if the transaction is not subject to coverage under HOEPA (e.g., reverse mortgage). Also enter Code 3 in the case of an application that does not result in an origination."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Lien Status.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(14)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the applicable Code for covered loans that you originate or purchase and for applications that do not result in an origination.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Secured by a first lien"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Secured by a subordinate lien"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Codes 1 or 2 for covered loans that you originate or purchase, as well as for applications that do not result in an origination (preapproval requests that are approved but not accepted, preapproval requests that are denied, applications that are approved but not accepted, denied, withdrawn, or closed for incompleteness)."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Credit Score.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(15)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Score.",
                                    "description": "Enter the credit score or scores relied on in making the credit decision, using column \"A\" for the applicant or borrower and, where required by Regulation C, column \"CA\" for the first co-applicant or co-borrower. Where Regulation C requires you to report a single score for the transaction that corresponds to multiple applicants or borrowers, use column \"A.\" Enter \"NA\" for purchased covered loans."
                                },
                                {
                                    "id": "2",
                                    "label": "Name and Version of Model.",
                                    "description": "For each credit score reported, use the following Codes to indicate the name and version of the model used to generate the credit score relied on in making the credit decision, using column “A” and column “CA” as applicable.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Equifax Beacon 5.0"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Experian Fair Isaac"
                                        },
                                        {
                                            "id": "3",
                                            "description": "FICO Risk Score Classic 04"
                                        },
                                        {
                                            "id": "4",
                                            "description": "FICO Risk Score Classic 98"
                                        },
                                        {
                                            "id": "5",
                                            "description": "VantageScore 2.0"
                                        },
                                        {
                                            "id": "6",
                                            "description": "VantageScore 3.0"
                                        },
                                        {
                                            "id": "7",
                                            "description": "More than one credit scoring model"
                                        },
                                        {
                                            "id": "8",
                                            "description": "Other credit scoring model"
                                        },
                                        {
                                            "id": "9",
                                            "description": "Not applicable"
                                        },
                                        {
                                            "id": "10",
                                            "description": "Purchased loan"
                                        },
                                        {
                                            "id": "11",
                                            "description": "No co-applicant"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 7 if more than one credit scoring model was used in developing the credit score."
                                        },
                                        {
                                            "id": "b",
                                            "description": " Use Code 8 for any credit scoring model that is not listed above, and provide the name and version of the scoring model used."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 9 if the file was closed for incompleteness or the application was withdrawn before a credit decision was made or if you did not rely on a credit score in making the credit decision."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Use Code 10 if the loan is a purchased loan."
                                        },
                                        {
                                            "id": "e",
                                            "description": " If there are no co-applicants or co-borrowers, use Code 11 for “no co-applicant” in the co-applicant column."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "1",
                            "label": "Reason for Denial.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(16)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Use the following Codes to indicate the principal reason or reasons for denial, indicating up to four reasons.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Debt-to-income ratio"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Employment history"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Credit history"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Collateral"
                                        },
                                        {
                                            "id": "5",
                                            "description": "Insufficient cash (downpayment, closing costs)"
                                        },
                                        {
                                            "id": "6",
                                            "description": "Unverifiable information"
                                        },
                                        {
                                            "id": "7",
                                            "description": "Credit application incomplete"
                                        },
                                        {
                                            "id": "8",
                                            "description": "Mortgage insurance denied"
                                        },
                                        {
                                            "id": "9",
                                            "description": "Other"
                                        },
                                        {
                                            "id":"91",
                                            "description":"Conditional Free Form Text Field for Code 91: Other"
                                        },
                                        {
                                            "id": "10",
                                            "description": "Not applicable"
                                        }
                                    ]
                                },
                                {
                                    "id": "2",
                                    "description": "Use Code 9 for “other” when a principal reason your institution denied the application is not listed in Codes 1 through 8. For an application in which your institution enters Code 9, enter the principal reason or reasons the application was denied."
                                },
                                {
                                    "id": "3",
                                    "description": "Use Code 10 for “not applicable” if the action taken on the application, pursuant to § 1003.4(a)(8), is not a denial. For example, use Code 10 if the loan is originated or purchased by your institution, or the application or preapproval request was approved but not accepted, or the application was withdrawn before a credit decision was made, or the file was closed for incompleteness."
                                },
                                {
                                    "id": "4",
                                    "description": "If your institution uses the model form for adverse action contained in appendix C to Regulation B, 12 CFR part 1002 (Form C–1, Sample Notice of Action Taken and Statement of Reasons), use the foregoing Codes as follows:",
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Code 1 for: Income insufficient for amount of credit requested, and Excessive obligations in relation to income."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Code 2 for: Temporary or irregular employment, and Length of employment."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Code 3 for: Insufficient number of credit references provided; Unacceptable type of credit references provided; No credit file; Limited credit experience; Poor credit performance with us; Delinquent past or present credit obligations with others; Number of recent inquiries on credit bureau report; Garnishment, attachment, foreclosure, repossession, collection action, or judgment; and Bankruptcy."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Code 4 for: Value or type of collateral not sufficient."
                                        },
                                        {
                                            "id": "e",
                                            "description": "Code 6 for: Unable to verify credit references; Unable to verify employment; Unable to verify income; and Unable to verify residence."
                                        },
                                        {
                                            "id": "f",
                                            "description": "Code 7 for: Credit application incomplete."
                                        },
                                        {
                                            "id": "g",
                                            "description": "Code 9 for: Length of residence; Temporary residence; and Other reasons specified on the adverse action notice. For an application in which your institution enters Code 9 for Other reasons, enter the principal reason or reasons the application was denied."
                                        }
                                    ]
                                },
                                {
                                    "id":"5",
                                    "description":" If Code 91 is selected, enter the denial reason."
                                }
                            ]
                        },
                        {
                            "label": "Loan Costs.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(17)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the amount of total loan costs, expressed in dollars, as described in Regulation Z, 12 CFR 1026.38(f)(4) if a Closing Disclosure is provided for the covered loan pursuant to Regulation Z, 12 CFR 1026.19(f); or"
                                },
                                {
                                    "id": "2",
                                    "description": "Enter the total points and fees charged in connection with the covered loan, expressed in dollars and calculated pursuant to Regulation Z, 12 CFR 1026.32(b)(1) if the covered loan is not subject to the disclosure requirements in Regulation Z, 12 CFR 1026.19(f)."
                                }
                            ]
                        },
                        {
                            "label": "Total of All Itemized Amounts.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(18)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter “NA” for applications or preapproval requests denied or approved but not accepted, or files closed for incompleteness."
                                },
                                {
                                    "id": "2",
                                    "description": "Enter “NA” for covered loans not subject to this reporting requirement, such as open-end lines of credit or reverse mortgages."
                                }
                            ]
                        },
                        {
                            "label": "Total Discount Points.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(19)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": " Enter “NA” for applications withdrawn, applications or preapproval requests denied or approved but not accepted, or files closed for incompleteness."
                                },
                                {
                                    "id": "2",
                                    "description": "Enter “NA” for covered loans not subject to this reporting requirement, such as open-end lines of credit or reverse mortgages."
                                }
                            ]
                        },
                        {
                            "label": "Lender Credits.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(20)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter “NA” for applications withdrawn, applications or preapproval requests denied or approved but not accepted, or files closed for incompleteness."
                                },
                                {
                                    "id": "2",
                                    "description": "Enter “NA” for covered loans not subject to this reporting requirement, such as open-end lines of credit or reverse mortgages."
                                }
                            ]
                        },
                        {
                            "label": "Interest Rate.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(21)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter “NA” for covered loans for which no interest rate is applicable, or for applications or preapproval requests for which the interest rate was unknown at the time the final action was taken."
                                }
                            ]
                        },
                        {
                            "label": "Prepayment Penalty Term.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(22)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the term in months of any prepayment penalty applicable to the covered loan or application. For example, if a prepayment penalty may be imposed within the first 24 months after closing or account opening, enter 24."
                                },
                                {
                                    "id": "2",
                                    "description": "Enter “NA” for covered loans for which a prepayment penalty may not be imposed under the terms of the covered loan or for covered loans not subject to this reporting requirement, such as purchased covered loans."
                                }
                            ]
                        },
                        {
                            "label": "Debt-to-income Ratio.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(23)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the ratio of the applicant’s or borrower’s total monthly debt to the total monthly income that your institution relied on in making the credit decision (debt-to-income ratio)."
                                },
                                {
                                    "id": "2",
                                    "description": "If your institution did not rely on the ratio of the applicant’s or borrower’s total monthly debt to the total monthly income in making the credit decision, if a file was closed for incompleteness, or if an application was withdrawn before a credit decision was made, enter “NA.” Also enter “NA” for reverse mortgages. Also enter “NA when the applicant or borrower is a non-natural person and when the property securing, or proposed to secure, the covered loan is a multifamily dwelling."
                                }
                            ]
                        },
                        {
                            "label": "CLTV Ratio.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(24)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "If your institution did not rely on the combined loan-to-value ratio in making the credit decision, if the file was closed for incompleteness, or if the application was withdrawn before a credit decision was made, enter “NA” for not applicable."
                                }
                            ]
                        },
                        {
                            "label": "Loan Term.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(25)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Loan Term.",
                                    "description": "Enter the scheduled number of months after which the legal obligation will mature or terminate or would have matured or terminated.",
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "For a covered loan that you purchased, enter the number of months after which the legal obligation matures as measured from the covered loan’s origination."
                                        },
                                        {
                                            "id": "b",
                                            "description": "For an open-end line of credit with a definite term, enter the number of months from origination until the account termination date, including both the draw and repayment period."
                                        },
                                        {
                                            "id": "c",
                                            "description": "For a covered loan or application without a definite term, such as a reverse mortgage, enter \"NA.\""
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Introductory Rate Period.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(26)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the number of months from loan origination until the first date the interest rate may change.",
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "For a fixed rate covered loan or an application for a fixed rate covered loan, enter \"NA.\""
                                        },
                                        {
                                            "id": "b",
                                            "description": "For a covered loan you purchased, enter the number of months until the first date the interest rate may change as measured from loan origination, or enter “NA” for a purchased fixed rate covered loan."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Balloon Payment.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(27)",
                                "subclause": "(i)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate if the covered loan or application requires a payment that is more than two times a regular periodic payment.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Interest-Only Payments.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(27)",
                                "subclause": "(ii)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate if the covered loan or application would permit one or more periodic payments to be applied solely to accrued interest and not to principal.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Negative Amortization.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(27)",
                                "subclause": "(iii)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate if the covered loan or application would permit a minimum periodic payment that covers only a portion of the accrued interest, resulting in an increase in the principal balance under the terms of the legal obligation.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Other Non-Amortizing Features.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(27)",
                                "subclause": "(iv)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate if the covered loan or application includes contractual terms other than contractual terms described in § 1003.4(a)(27)(i), (ii), and (iii) that would allow for payments other than fully amortizing payments during the loan term.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Property Value.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(28)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the value of the property securing the covered loan or, in the case of an application, proposed to secure the covered loan relied on in making the credit decision in dollars."
                                },
                                {
                                    "id": "2",
                                    "description": "If your institution did not rely on the value of the property in making the credit decision, if the file was closed for incompleteness, or if the application was withdrawn before a credit decision was made, enter “NA” for not applicable."
                                }
                            ]
                        },
                        {
                            "label": "Manufactured Home Secured Property Type.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(29)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate whether the covered loan is, or in the case of an application would have been, secured by a manufactured home and land or by a manufactured home and not land.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Manufactured Home and Land"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Manufactured Home and Not Land"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Not Applicable"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 1 if the covered loan is or would have been secured by both a manufactured home and the land on which it is sited."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 2 if the covered loan is or would have been secured by a manufactured home, but not by the land on which it is sited, even if the manufactured home is considered real property under applicable State law."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 3 if the covered loan or application does not relate to a manufactured home or if it is or would have been secured by a multifamily dwelling including a manufactured home community."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Manufactured Home Land Property Interest.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(30)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate whether the applicant or borrower owns the land on which a manufactured home is or will be located through a direct or indirect ownership interest or leases the land through a paid or unpaid leasehold according to the following codes:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Direct Ownership"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Indirect Ownership"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Paid Leasehold"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Unpaid Leasehold"
                                        },
                                        {
                                            "id": "5",
                                            "description": "Not Applicable"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 1 for a covered loan or application for which the applicant or borrower has or will have a direct ownership interest in the land on which the dwelling is or is to be located, such as fee simple ownership."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 2 for a covered loan or application for which the applicant or borrower holds or will hold an indirect ownership interest in the land on which the dwelling is or is to be located, such as through a resident-owned community structured as a housing cooperative that owns the underlying land."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 3 for a covered loan or application for which the applicant or borrower leases or will lease the land on which the dwelling is or is to be located and pays or will make payments pursuant to the lease, such as a lease for a lot in a manufactured home community."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Use Code 4 for a covered loan or application for which the applicant or borrower is or will be a tenant on the land on which the dwelling is or is to be located and does not or will not make payments pursuant to the tenancy, such as tenancy on land owned by a family member who has given permission for the placement of the manufactured home."
                                        },
                                        {
                                            "id": "e",
                                            "description": " Use Code 5 if the covered loan or application does not relate to a manufactured home, if a location for a manufactured home related to a covered loan or application has not been determined, or if the covered loan is or would have been secured by a multifamily dwelling including a manufactured home community."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Total Units.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(31)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the number of individual dwelling units related to the property securing the covered loan or, in the case of an application, proposed to secure the covered loan."
                                }
                            ]
                        },
                        {
                            "label": "Multifamly Affordable Units.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(32)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Enter the number of individual dwelling units related to the property securing the covered loan or, in the case of an application, proposed to secure the covered loan that are income-restricted pursuant to Federal, State, or local affordable housing programs.",
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "For a covered loan or application not related to a multifamily dwelling, enter \"NA.\""
                                        },
                                        {
                                            "id": "b",
                                            "description": "For a covered loan or application related to a multifamily dwelling that does not contain any such income-restricted individual dwelling units, enter \"0.\""
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Application Channel.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(33)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Application.",
                                    "description": "Indicate whether the applicant or borrower submitted the application directly to your institution.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Not applicable"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 1 if the applicant or borrower submitted the application directly to your institution."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 2 if the applicant or borrower did not submit the application directly to your institution."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 3 only if the loan is a purchased loan."
                                        }
                                    ]
                                },
                                {
                                    "id": "2",
                                    "label": "Initially Payable.",
                                    "description": "Indicate whether the covered loan was or, in the case of an application, would have been initially payable to your institution.",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Not applicable"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 1 if the covered loan was or, in the case of an application, would have been initially payable to your institution."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 2 if the covered loan was not or, in the case of an application, would not have been initially payable to your institution."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 3 if the loan is a purchased loan or for applications if you had not determined whether the loan would have been initially payable to your institution when the loan was withdrawn or denied."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Mortgage Loan Originator Identifier.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(34)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "NMLSR ID:",
                                    "description": "Enter the Nationwide Mortgage Licensing System and Registry mortgage loan originator unique identifier (NMLSR ID) as set forth in the Secure and Fair Enforcement for Mortgage Licensing Act of 2008, title V of the Housing and Economic Recovery Act of 2008 (S.A.F.E. Act), 12 U.S.C. 5101 et seq., as implemented by Regulation G (S.A.F.E. Mortgage Licensing Act—Federal Registration of Residential Mortgage Loan Originators), 12 CFR part 1007, and Regulation H (S.A.F.E. Mortgage Licensing Act—State Compliance and Bureau Registration System), 12 CFR part 1008."
                                },
                                {
                                    "id": "2",
                                    "label": "No NMLSR ID:",
                                    "description": "If the mortgage loan originator is not required to obtain and has not been assigned an NMLSR ID, enter \"NA\" for not applicable."
                                }
                            ]
                        },
                        {
                            "label": "Automated Underwriting System (AUS) and Recommendation.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(35)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "label": "Automated Underwriting System.",
                                    "description": "Indicate the name of the automated underwriting system (AUS) used by your institution to evaluate the application by entering the applicable Code from the following:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Desktop Underwriter"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Loan Prospector"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Technology Open to Approved Lenders (TOTAL Scorecard"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Guaranteed Underwriting System (GUS)"
                                        },
                                        {
                                            "id": "5",
                                            "description": "Other"
                                        },
                                        {
                                            "id": "6",
                                            "description": "Not applicable"
                                        },
                                        {
                                            "id": "7",
                                            "description": "Purchased loan"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Code 1 for the AUS developed by the Federal National Mortgage Association (Fannie Mae) or any successor."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 2 for the AUS developed by the Federal Home Loan Mortgage Corporation (Freddie Mac) or any successor."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 3 for the AUS developed by the U.S. Department of Housing and Urban Development for Federal Housing Administration (FHA) loans."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Use Code 4 for the AUS developed by the U.S. Department of Agriculture for Single Family Housing Guaranteed Loan Program loans."
                                        },
                                        {
                                            "id": "e",
                                            "description": " Use Code 5 for an AUS developed by a securitzer, Federal government insurer, or guarantor not listed in Codes 1 through 4. For a transaction in which your institution enters Code 5, enter the name of the AUS used to evaluate the application."
                                        },
                                        {
                                            "id": "f",
                                            "description": "Use Code 6 for “not applicable” if your institution did not use an AUS developed by a securitzer, Federal government insurer, or guarantor to evaluate the application."
                                        },
                                        {
                                            "id": "g",
                                            "description": "Use Code 7 if the loan is a purchased loan."
                                        }
                                    ]
                                },
                                {
                                    "id": "2",
                                    "label": "Automated Underwriting System Result:",
                                    "description": "Indicate the result generated by the automated underwriting system (AUS) used by your institution to evaluate the application by entering the applicable Code from the following:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "Approve/Eligible"
                                        },
                                        {
                                            "id": "2",
                                            "description": "Approve/Ineligible"
                                        },
                                        {
                                            "id": "3",
                                            "description": "Refer/Eligible"
                                        },
                                        {
                                            "id": "4",
                                            "description": "Refer/Ineligible"
                                        },
                                        {
                                            "id": "5",
                                            "description": "Refer with Caution"
                                        },
                                        {
                                            "id": "6",
                                            "description": "Out of Scope"
                                        },
                                        {
                                            "id": "7",
                                            "description": "Not Submitted"
                                        },
                                        {
                                            "id": "8",
                                            "description": "Accept"
                                        },
                                        {
                                            "id": "9",
                                            "description": "Caution"
                                        },
                                        {
                                            "id": "10",
                                            "description": "Ineligible"
                                        },
                                        {
                                            "id": "11",
                                            "description": "Incomplete"
                                        },
                                        {
                                            "id": "12",
                                            "description": "Invalid"
                                        },
                                        {
                                            "id": "13",
                                            "description": "Refer"
                                        },
                                        {
                                            "id": "14",
                                            "description": "Other"
                                        },
                                        {
                                            "id": "15",
                                            "description": "Not applicable"
                                        },
                                        {
                                            "id": "16",
                                            "description": "Purchased loan"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "Use Codes 1 through 7 for the AUS result returned by the AUS of the Federal National Mortgage Association (Fannie Mae) or any successor."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Use Code 8 through 12 for the AUS result returned by the AUS of the Federal Home Loan Mortgage Corporation (Freddie Mac) or any successor."
                                        },
                                        {
                                            "id": "c",
                                            "description": "Use Code 8 or 13 for the AUS result returned by FHA TOTAL Scorecard."
                                        },
                                        {
                                            "id": "d",
                                            "description": "Use Code 3, 8, or 13 for the AUS result returned by GUS."
                                        },
                                        {
                                            "id": "e",
                                            "description": "Use Code 14 for any AUS result not listed in Codes 1 through 13. For a transaction in which your institution enters Code 14, enter the result generated by the AUS developed by a securitzer, Federal government insurer, or guarantor that was used to evaluate the application."
                                        },
                                        {
                                            "id": "f",
                                            "description": "Use Code 15 for \"not applicable\" if your institution did not consider a result generated by an AUS developed by a securitzer, Federal government insurer, or guarantor in its underwriting process. For example, use Code 15 if your institution only manually underwrote the application. Also, use Code 10 if the file was closed for incompleteness or the application was withdrawn before a credit decision was made."
                                        },
                                        {
                                            "id": "g",
                                            "description": "Use Code 16 if the loan is a purchased loan."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Reverse Mortgage Flag.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(36)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate whether the covered loan is, or the application is for, a reverse mortgage by entering one of the following Codes, as applicable:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True (Is a reverse mortgage)"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False (Is not an open-end line of credit)"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Open-End Line of Credit Flag.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(37)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate whether the covered loan is, or the application is for, an open-end line of credit by entering one of the following Codes, as applicable:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True (Is an open-end line of credit)"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False (Is not an open-end line of credit)"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "label": "Flag for Covered Loan With Business or Commercial Purpose.",
                            "citation": {
                                "paragraph": "4",
                                "subparagraph": "(a)",
                                "clause": "(38)"
                            },
                            "sections": [
                                {
                                    "id": "1",
                                    "description": "Indicate whether the loan or line of credit is, or the application is for, a covered loan that is primarily for a business or commercial purpose, by entering one of the following Codes, as applicable:",
                                    "codes": [
                                        {
                                            "id": "1",
                                            "description": "True (Is primarily for a business or commercial purpose)"
                                        },
                                        {
                                            "id": "2",
                                            "description": "False (Is not primarily for a business or commercial purpose)"
                                        }
                                    ],
                                    "notes": [
                                        {
                                            "id": "a",
                                            "description": "If the application or covered loan is primarily for a business or commercial purpose, enter Code 1 (True)."
                                        },
                                        {
                                            "id": "b",
                                            "description": "Unless the application or covered loan is primarily for a business or commercial purpose, enter Code 2 (False)."
                                        }
                                    ]
                                }
                            ]
                        }

                    ]
                }
            ]
        },
        {
            "id": "II",
            "title": "INSTRUCTIONS FOR REPORTING TO THE BUREAU OF APPROPRIATE FEDERAL AGENCIES",
            "subsections": [
                {
                    "label": "Reporting",
                    "citation": {
                        "paragraph": "5",
                        "subparagraph": "(a)"
                    },
                    "sections": [
                        {
                            "id": "1",
                            "description": "Financial institutions are required to submit all required data to the Bureau via the Bureau’s website or via secure electronic submission as specified by the Bureau in prescribed procedures and technical specifications."
                        },
                        {
                            "id": "2",
                            "description": "Data required to be submitted that are not recorded on the loan application register shall be submitted with the loan application register on the transmittal sheet or in such other format specified by the Bureau."
                        }
                    ]
                }
            ]
        }
    ]
}